content-org/personal_lists.org
#+hugo_section: personal_lists

* Conversations dump
:PROPERTIES:
:EXPORT_FILE_NAME: conv_dump
:END:
These are dumps from my phone notes, some of these came up during conversations, self talk, reading something online etc. This is absolute horseshit btw, I am keeping these for historical reasons and now that i had a look at these, i cringed by a lot and also moved by head left and right in disagreement with myself. These are historical, newer thoughts go into org-journal and it's not public for private reasons.

