content-org/personal_lists.org
** Probably selftalk
- Learning something strange requires reassembling of our brain. I like it. I want to do that often.
- It's this process of getting out of this mess that i'll appreciate and not the life i'll live after.
- you want to take the lower bed and a higher shelf on the wardrobe when taking a hostel while traveling.
- i tweet when i feel things. it's a good day when i am tweeting often ig.
- comfort is a cage, do hard things.
- I am and & will not stop. - idk what i mean
- you study all this to become someone you do not want to become just so that you can make some money. once you make dem monie, you're allowed to do what you want. people can't take creative risks here.
- I just want to be a programmer who is comfortable calling himself a programmer
- on inventing: There's a lot of knowledge in other people's head, you can come up with your own knowledge. Lot of knowledge is out there floating in other people's head they did never pay enough attention to that floating thought. Sometimes someone pays extra attention to the thought and tries to formalize it and then that person becomes an inventor, or like the coiner of the term or something
- You know you're working on the edge when you don't have a book for what you're reading. You need to read academic papers etc.
- When trying to learn something it's good to see what space it fits in, see what alternatives it has; what set of problems is it solving. googling alternatives; another nice trick is to look at the category section in wikipedia to see what category of things it falls into even though it's not always 100% accurate.
- I don't want to build companies, I want to build standards, but currently I don't have the skills.
- Time has the ability to make things less valuable, what do we need to make things resistant against it?
- Because the hardware of our brain is not good enough, we need to develop algorithms that suit our mind to understand the world. Some people understand things easily because they have better brains, we can do similar stuff but we need algorithms that fit with our brain and only we can do that to ourselves.
- I am 23, I sometimes wish I was this curious when I was 13. It's okay, you can just reset. You are better equipped now, maybe you can do the things 13yo Hrishi could do twice as fast. You just need to start. You'll age anyway.
- took me a lot of balls to admit that i know nothing about maths at 23 and start doing 6th grade math. - same at 25 lol
- When we try to make a language good the popularity usually lies on the things that were built and then programming language like Erlang by design is very good and stuff but it can be popular because of the things that were built with it similarly if we want to make SMS popular so we have to build more beautiful things with SMS so if you write great books get poetry so the applications of that language should be popular so then eventually the language would become popular
- I think programming is a creative endeavour and I like to put creative people into two buckets, performers and practitioners but usually in my observation people are of the mixed kind.
  - Performers: When practicing these people train their mind and body to perfect components of their art and when performing they let whatever they learned flow through their mind and body and be present in the moment.
  - Practitioners: These people are sort of always working and do not have a stage to perform. They know their art and keep on improving their art as they work their art. Doctors or programmers might seem to fit in as practitioners but they are also performers when it comes to taking the right decision at the right time, coming up with a bright new idea etc. I want to be both but currently none at all. I can’t code properly and i take stupid decisions, all my decisions are simply intuitions.
- Gaming ping and relation to future: We can simulate future by sending information slower to some user. Future is just unavailability of information in the present. Information here is not just  the knowledge but the happening. Eg. If you have faster connection, you have access to the future.
- If you're not sure whether what you're doing is ethical or not, it's better to not do it. imo.
- does the definition of edge computing include our brains?
- I am deeply troubled. I am stuck in 17yo me when i am 24. I still want the same things, I still have the same dreams. It's not good. I don't like who I am. I have to come out of my body look at myself change myself.
- Using curiosity to learn, see what's happening in the real world in every subject and then reverse engineer from that.
- Me apna privilege bech dega bhenchod. How to sell your privilege.
- The input bandwidth is good, we can take input. But output has to be in some expressive way, talk, draw, act, write etc.
- So form tomorrow and till the day i die, i'll play my cards right no matter what. It's a game and i am here to win and help win.
- I would like to share five stupid realizations (about sorting life):
  - We are on our own journey and comparing with anyone is a complete waste of time. We need to define what sorting our life really meant to us and it's completely okay if that makes zero sense to other people.
  - Understanding the role of luck and how it compliments hard work.
  - Understanding momentum. We need to conserve momentum at all costs. fewer cold starts makes our lives easier. Also easier said than done. How your yoga streak broke.
  - No matter what we do, we should be having fun.
  - talk to stella (very important)
- I am 24, I should already have started on my mission. It's not late but will be late if i start 2-3 years later. It's time.
- If you can't use that knowledge, bro what is the use of that knowledge
- a museum, a library and a education research lab
- It haunts me everyday that i cannot be a computer scientist. It'll merely be a developer no matter how much I try.
- It's nature of life that people will dislike you for no reason. People will tend to express some affection towards you and suddenly they will be completely opposite. There might be no reason for such actions. It's the rules of the games. It's a game you play even if you know you will loose.
- Having emotions is a luxury that I can't afford right now
- Become very true to yourself, write who you think you are, that you're a dumb person with this and this disability, you don't know this and these things you want to do this and this. Basically, write the truth about who i really am. And what is my perspective on life and how i want to live it.
- I like science and history because they help me answer my questions. I want to love and study more maths because It has so many more interesting answers.
- getting back in shape is hard (when trying to re-learn code after not writing code for about a year)
- Humans think very hard to understand their world and by understanding it they are able to represent their views in different forms such as maths. which helps in development of new worlds. Eg. calculus came from observing the world and from someone's mind. then calculus was used to create new things which birthed a new world. It's crazy. - Again, no idea what I am talking about.
- You can only thrive if the environment around you thrives. Applies at personal level too. You need to have control over you aswell as your environment. If the environment around you is instable, you won't be able to be in a stable state for long.
- We humans and like any other animals don't actually understand language. We just get better at identifying sounds. We(animals) communicate with our senses, seeing, tasting, hearing/speaking etc. The fact that animals can communicate with humans without sharing or learning a special language that both of us know points to something else. Plants on the other hand (if they can't hear) they communicate using light, they sense the sunlight. Sunlight becomes a way to indicate them something. (or no?)
- Sometimes i feel physical pain on things that happen in my dream , if someone kicks me in my dream. I mean i don't feel any pain after i wakeup but i am in pain in my dream so a lot of the physical things that humans experience are also mental. (simulation?)
- human-computer interface → dream computer interface.
- Even if some human understands a language, he might not understand what's being communicated. Even after having a rational mind, he/she is not able to understand what's being communicated despite being able to understand the language. (Me reading a book on quantum computing). - Obvious but I don't know why i felt the need to put this down.
- History is a data structure that you can use inside you mind to store information about the world. It's a index. The chaos of information becomes better organized if you learn history.
- Wrong mentoring worse than no mentoring
- Of all things one should be able to create happiness for themselves.
- My first job made me hate my entire profession (no hate towards my employer, i was fucked up)
- I am loosing hope in myself. I think this is the very moment i am getting myself into depression or whatever. But i am going to fight it and remember why i am doing all this for. - dec28’21
- Work ethic means you can get up to 1 from 0 if it happens, keeping notes means that you can get to 1 from 0 even quicker.
- froken bamilies suck so mucking fuch
- If you can ignore the opinion of other people and let them live in peace with their opinions, you can do the same to the opinions that involve you. When you can ignore other people's opinion about you then you truly reach the idgaf attitude which is essential for you to become dangerous.
- As humans, we are manually building our software for our brain rather than using a package manager
- To be able to draw and color whatever came to my dream
- One can spend a lot of time misusing the building blocks if one doesn’t understand them properly.
- Setting myself in foot of the 15y/o me as a 23 y/o guy. reap the benefits of maturity, judgment with curiosity.
- Sometimes we have to go away from our goal to reach our goal?
- The goal is to find the goal
- Learning from the past was helpful for me because I was good at few things back then which i am not good at now. so when you're good at something make notes so that you can learn from yourself later on in life.
- Mindset
  - Rather than having a recipe, have a mindset.
  - Mindset is a enabler or blocker to learning something.
  - Just givinG inspiration about why you should learn something does not form the mindset needed.
- there's a lot of info out there, but how much of it is relevant?
- I've something to prove, that kids from small villages can do a lot if they are taught the right way. Not giving them the right education and opportunity is discrimination. Internet scales by design, we just have to teach them how to use the internet and possibilities are endless.
- You don't need such strong note taking measures if you don't jump around a lot. But if you do, like me jump around so many areas at the same time. Notetaking becomes v.essential. Eg. if you just work on database you still need notes but since most of the time things will be the same the environment you work with will be your note but for someone who wants the same but also wants to hop into other ideas, need to take notes which is slow and tedious but works imo. - I absolutely have no fucking clue what i am talking about here.
- At every point in time, I make a choice. It's all about making the correct choice. We need to speed up this choice step at the same time make it more accurate. So that we can make all the choices the best and move fast. What will be the correct choice? Future has the answer, look deep into the future.
  - Contradictory, "Life isn't about getting forecasts "right"; it is about navigating the environment and controlling it." i.e if you cannot control a complex environment (x), then control your exposure to it [f(x)].
