content-org/personal_lists.org
** Probably conversations with others
- The whole future lies in uncertainity, live immediately
- find something that is enjoyable to you and valuable to others
- The magic isn't in the book, it's in the reading.
- the part of life we really live is small, all the rest of it is not life, but merely time
- We think our opinions are formed through thought and marshaling of facts and evidence. But in reality, most are formed emotionally and then covered over with a thin veneer of "facts" and "evidence."
- "A human being should be able to change a diaper, plan an invasion, butcher a hog, conn a ship, design a building, write a sonnet, balance accounts, build a wall, set a bone, comfort the dying, take orders, give orders, cooperate, act alone, solve equations, analyze a new problem, pitch manure, program a computer, cook a tasty meal, fight efficiently, die gallantly. Specialization is for insects.
- When two people fall in love, their rational thinking decrease and they become stupid but it feels good
- once you realize that in any given context, you've got a finite amount of influence you can exert on your surroundings. Picture a sports coach who's been yelling at his team for so long, the message falls on deaf ears. Leverage other voices (if the advice is good).
- Your values and your emotions is your political opinion.
- you need to be thinking relative to a problem, you need to have a constraint which you can optimize for, and this tells you what it means to have a right or wrong answer to a question." — Situating LessWrong in contemporary philosophy: An interview with Jon Livengood
- i love the smell of coredumps in the morning
- the score takes care of itself if everyone in the organization does their work precisely and accurately and is done consistently. This was jeff Bezos's way of measuring inputs.
- Behaviors that are rewarded in the zoo are suicidal in the jungle.
- Just like food should be the last thing to cut off because of cost. You might not go watch that avengers movie than to have subpar food. Similarly, the education budget is the last thing to do the cut off in, for the funding body.
- life mast nahi, thik chal rahi hai
- A lot of this is about figuring about what works for you. I think a lot of people forget in the pursuit of productivity that what you're really trying to do with a lot of these tools is offload the work that your brain has to do. But then if that process itself requires so much brain work to use and organize and migrate and so on, your brain is being made to do the exact opposite thing you were supposed to help solve in the first place.
- The reason silicon valley was sillicon valley because hardware people and software people were complimenting each other to improve the ecosystem.
- science is the negotiation between our noisy representation and what's actually out there
- A penny saved is a penny earned.
- Flatmate type family bur
- I didn't read books for quite a long time because I thought books will change how I think because I was not ready to think for myself, this helped me form my own view about the world before I started believing on random stuff. i am way too much still the kid who coasted through school on raw intelligence to do things using routine and habit, and i have tried (and failed)
- just sit and think of something emotionally uncharged, basic things. Keep doing it. You can see your thoughts. This sort of proves that you're not your thoughts but in high pressure situation we feel trapped by it and it feels like we are our thoughts. practice stopping thinking about a thought in the middle - Jonathan Blow in some yt video
- It's not that just our brain can be trained our hands can be trained to so kind of non-living things like hands which seem unintelligent things can also be trained for example my right hand can do things but my left hand cannot and if I train my left hand to do it it will be able to do it but at times this actions do not involve the brain my hand just can do direction without having any intelligence in it so work can be a byproduct of training and it can persist
- Training conflict affected youth to become technology leaders
- If you want success, figure out the price, then pay it
- Unless you pick your battles consciously, battles will pick you. And pretty soon, you’d find yourself fuming about why you’re not winning.
- Why make the same mistakes others have made and written about?
- ultimate hack that you can learn things by reading
- people contain multitudes
- worst day of fishing better than best day at work
- Theory: Organized body of knowledge with predictive powers
- One unfortunate thing about writing is that you don’t know whether it has become clearer by the virtue of the writing itself or by having read the thing a hundred times during the edit
